Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetHandler.CreateCurvedDimensionSetRadial Method
Overload List
Name | Description
CreateCurvedDimensionSetRadial(ViewBase, Point, Point, Point, PointList, Double)
 Creates a curved dimension set from the specified points and inserts it to the database. Uses the default attributes.
CreateCurvedDimensionSetRadial(ViewBase, Point, Point, Point, PointList, Double, CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes)
 Creates a curved dimension set from the specified points and inserts it to the database.
Top
See Also
Reference
CurvedDimensionSetHandler Class
Tekla.Structures.Drawing Namespace